// © Copyright 2012-2013, 2015-2016 HP Development Company, L.P.

// Task name & description
HSDTaskName = "Proxy Server Settings";
HSDTaskDescription = "The printer supports connection to the Internet. If you use a proxy server to connect to the Internet, configure the settings below.";
TaskDescriptionInAssistantMode = "To connect to HP Web Services, your printer will need to connect to the Internet. If you use a proxy server to connect to the Internet, enter the settings below.\n\nIf you do not know your proxy settings, refer to the settings in the Network preference pane or contact your system administrator.";

// Radio buttons matrix
HSDProxyServerNotRequiredTitle = "A proxy server is not required to connect to the Internet";
HSDAutomaticProxySettingsTitle = "Automatic (the device will detect the settings automatically)";
HSDCustomProxySettingsTitle = "Custom proxy server configuration:";
// push button
HSDSystemProxySettingsTitle = "Copy System Settings";


// Proxy server settings
HSDProxyServerTitle = "Proxy Server:";
ProxyPortTitle = "Proxy Port:";

// Authentication
HSDRequiresAuthenticationButton = "Proxy server requires authentication";
HSDUserNameTitle = "Username:";
HSDPasswordTitle = "Password:";

HSDApplyNowButtonTitle = "Apply Now";

// progress titles
UpdateInformationProcessTitle = "Updating information...";

// alerts
EmptyProxyServerOrPortErrorText = "Both proxy server and proxy port have to be specified.";

EmptyUserNameOrPasswordErrorText = "Proxy server authentication requires both username and password to be specified.";

IncorrectProxyServerNameFormatErrorText = "Failed to set proxy server name. Check if format is valid.";

HSDUserNameTooLargeErrorText = "The Username is too large. Your device supports a maximum of %d characters in a username.";
